{
  "meta": {
    "theme": "professional"
  },
  "basics": {
    "name": "Sam Safaei",
    "phone": "tel:+1-647-562-4007",
    "label": "Product Management / Software Architect",
    "image": "https://www.gravatar.com/avatar/e99b5b7b9bb087ee76a6c9f1c6c47290?s=500",
    "summary": "With over 15 years of experience, I have excelled in product and software project management, engineering, test and leadership across various stages of the software lifecycle. As a Product Owner, Project Manager, and Senior Consultant, I have driven requirement gathering, roadmap prioritization, and strategic cross-functional collaboration to deliver complex software solutions and guide organizations in achieving modular, scalable architectures. My expertise includes client interaction, agile leadership, and backlog management, underpinned by a strong foundation in software development using C++, Python, and DevOps practices. I bring a proven ability to align technical execution with business goals, optimize processes, and deliver impactful, high-quality solutions in dynamic environments while advising clients on strategic software transformations.",
    "email": "sam.c.safaei@gmail.com",
    "citizenship": "Sweden",
    "locationTemp": {
      "city": "Toronto",
      "countryCode": "CA"
    },
    "profiles": [
      {
        "url": "https://github.com/safa0",
        "username": "safa0",
        "network": "github"
      }
    ]
  },
  "certificates": [
    {
      "name": "Machine Learning Specialization",
      "date": "2021-05-01",
      "issuer": "DeepLearning.AI"
    }
  ],
  "education": [
    {
      "endDate": "2012-06-12",
      "startDate": "2010-09-01",
      "area": "Computer Science",
      "studyType": "Master",
      "institution": "Chalmers University of Technology"
    }
  ],
  "skills": [
    {
      "keywords": ["AUTOSAR", "Android Automotive", "Telecom 3GPP Standards"],
      "name": "Domain Knowledge"
    },
    {
      "keywords": [
        "Docker",
        "Git",
        "Linux",
        "Jira",
        "Confluence",
        "Kubernetes",
        "Jenkins",
        "Microsoft Project",
        "Atlasian"
      ],
      "name": "Tools"
    },
    {
      "keywords": [
        "C++",
        "CMake",
        "Python",
        "Embedded Systems",
        "Design Patterns",
        "microservices",
        "Domain Driven Design"
      ],
      "name": "Software Development & Programming"
    },
    {
      "keywords": ["NLP", "Speech recognition", "Ontology generation"],
      "name": "AI & Machine Learning"
    }
  ],
  "work": [
    {
      "company": "MM Consulting",
      "name": "MM Consulting",
      "position": "Senior Consultant / Software Architect",
      "startDate": "2022",
      "summary": "",
      "highlights": [
        "Coach and guide clients in developing and revising software architectures to ensure long-term platform reusability",
        "Collaborate with client architects and C-level leadership to align software, hardware, and mechanical design strategies",
        "Challenge conventional approaches by asking critical questions to drive cross-disciplinary alignment",
        "Facilitate defining and integrating business goals into architectural planning and execution"
      ]
    },
    {
      "company": "Semcon / DXC Technology",
      "name": "Semcon / DXC Technology",
      "position": "Product Owner",
      "startDate": "2020",
      "endDate": "2022",
      "summary": "DXC Technology Automotive Line of Business provides software solutions for automotive OEMs and Tier 1 suppliers. Our team of 60-members, Service Layer, supplies the Android Automotive stack for in-vehicle-infotainment (IVI).",
      "highlights": [
        "Product Owner for Service Layer, Audio, Radio, Media, and voice control modules",
        "Defined and refined requirements, managing product backlog and roadmap priorities",
        "Led and coordinated three development teams and third-party suppliers",
        "Drafted and negotiated contracts, outlining roles and responsibilities for stakeholders",
        "Aligned development roadmaps with both internal and external suppliers and clients, responsible for timely delivery",
        "Proactively identified and resolved blockers to ensure smooth project execution",
        "Leveraged experience with virtual assistants to improve cross-functional collaboration"
      ]
    },
    {
      "company": "Semcon / Yeti Move",
      "name": "Semcon / Yeti Move",
      "position": "Senior Software Engineer",
      "startDate": "2019",
      "endDate": "2020",
      "summary": "Yeti Move delivers autonomous technology and cloud-based fleet management, starting with self-driving snow ploughs for airports and expanding to heavy machinery solutions. We hold major global contracts, including autonomous snow removal for Swedavia airports.",
      "highlights": [
        "Designed, implemented, and maintained the equipment control components as component owner.",
        "Facilitated communication between the server, PLC components, and autonomous decision-making systems.",
        "Translated business logic between cloud servers and PLCs, ensuring accurate updates from sensors.",
        "Refactored the component from the ground up, incorporating state machines, communication layers, and fail-safe mechanisms.",
        "Managed a comprehensive fleet management solution, including user portal, cloud server, and embedded systems.",
        "Responsible for commercialization and commisioning of the solution in the field."
      ]
    },
    {
      "company": "Semcon",
      "name": "Semcon",
      "position": "Senior Software Engineer",
      "startDate": "2018",
      "endDate": "2019",
      "summary": "Software Developer - Multiclient (2019/2020) Developed an AI-driven virtual assistant for natural language information retrieval, similar to Google Home and Alexa.",
      "highlights": [
        "Assisted Data scientist with data pipelines and AI systems, focusing on natural language understanding and speech recognition.",
        "Built a microservice architecture with backend components and communication managed in Python.",
        "Integration and customization of speech recognition system, Mozilla’s DeepSpeech and custom post-processing scripts.",
        "Created ontology generation and retrieval processes using Stanford NLP and sequence-to-sequence and hourglass models."
      ]
    },
    {
      "company": "Ericsson",
      "name": "Ericsson",
      "position": "Senior Software Engineer (L6) / Product Owner",
      "startDate": "2012",
      "endDate": "2018",
      "summary": "Ericsson, Packet Core (EPC 4g/5g) provides internet backbone and core network functionality for mobile communications.",
      "highlights": [
        "From 2012 to 2018, I held diverse roles at Ericsson, contributing to software development, team leadership, and tool implementation to optimize processes",
        "Enhanced mini-link product efficiency by introducing tools like profilers and IWYU (Include What You Use)",
        "Migrated and refactored legacy Rhapsody code to C++",
        "Managed the full software development lifecycle for the PDN Gateway node",
        "Worked directly with clients such as Verizon as part of professional services teams.",
        "Focus on functional testing, bug resolution, and proposed, implemented and deployed tools and solutions, as lead engineer and acting product owner, adopted by 300+ developers.",
        "Delivered agile coaching and software design training internationally for Session Getway (Mobile backbone of 4G/5G networks) in China."
      ]
    },
    {
      "company": "Volvo Trucks",
      "name": "Volvo Trucks",
      "position": "Research Engineer",
      "startDate": "2011",
      "endDate": "2012",
      "summary": "Volvo Trucks, Advanced Technology & Research",
      "highlights": [
        "Developed a predictive model for assessing speedup gains when migrating software from single-core to multicore platforms, enhancing performance forecasting in automotive systems",
        "Conducted empirical measurements of inter-core and intra-core communication times within AUTOSAR environments, identifying potential bottlenecks and informing optimization strategies",
        "Evaluated the impact of cross-core communication overhead on system performance, providing insights for efficient software distribution across multicore processors"
      ]
    }
  ]
}
